{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"1650302218f3be8ed5":{"type":"rich-text","settings":{"text_width":"narrow","title":"Preventative Maintenance on Ellipticals, Treadmills & Fitness Equipment","content":"<p>A locally owned company with an in-house service department committed to providing our customers the highest quality commercial fitness equipment and excellent customer service and equipment maintenance.<\/p>","button_text":"","button_link":"shopify:\/\/collections\/all"}},"1650302002cca9dd0e":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/henderson.png","image_position":"left","image_width":50,"title":"DESIGN AND CONSULTATION","content":"<p>Design and consultation is a complimentary service we provide to all of our customers. Provide us with the dimensions of your space and we will design a floor plan that will maximize limited space, capture your style, and promote safety.<\/p><p>For commercial and custom home gyms we will schedule a consultation and visit your location to personally measure your space and discuss design ideas. This is recommended so we have an accurate representation of your space including electrical outlets, windows, and any structural factors that can influence the design. We will provide you with a blueprint of your design to help you visualize the flow and feel of your new gym. Our gym designs are always customized to your space and include audio\/video, mirrors, and rubber flooring.<\/p>","button_text":"View products","button_link":"shopify:\/\/collections\/all"}},"165030201229493a67":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/summerlin.png","image_position":"right","image_width":50,"title":"SERVICE, DELIVERY, AND INSTALLATION","content":"<p>Pacific Fitness Equipment offers service and delivery to new and existing customers. Allow our in-house service technicians to deliver and install your fitness equipment saving you the time and frustration of installing it yourself. With every install our technicians will perform a thorough examination to ensure your fitness equipment is in proper working condition.<\/p><p>For existing customers, if there is an issue with your fitness equipment we will send a service technician out to diagnose and repair your equipment. We service all warranty and non-warranty items, including existing fitness equipment in your home that has not been purchased from one of our locations.<\/p><p>Pacific Fitness Equipment also provides a fitness equipment relocation service. If you are planning a move, call and schedule an appointment for fitness equipment relocation. Whether the equipment is a treadmill, strength piece, or home gym we will carefully disassemble and remove your equipment, relocate it to the new location, reassemble, and make sure it is in proper working condition.<\/p>","button_text":"View products","button_link":"shopify:\/\/collections\/all"}},"1650302020878177f5":{"type":"image-with-text","settings":{"image":"shopify:\/\/shop_images\/valley-view.png","image_position":"left","image_width":50,"title":"PREVENTATIVE MAINTENANCE","content":"<p>Preventative Maintenance is recommended for fitness equipment that is sustaining heavy usage throughout the day on a daily basis. Apartment complexes, casinos, and master planned community fitness centers are typical customers that use this service.<\/p><p>On a monthly, bimonthly, or quarterly basis our service technicians will visit your facility and perform a thorough examination of each piece of fitness equipment to make sure it is in good condition. Our residential customers can benefit from preventative maintenance service; however we recommend this service every 6 months.<\/p><p>Should we discover a potential repair we will diagnose and restore your fitness equipment in a timely manner to minimize down time.<\/p><p>Preventative Maintenance contracts can be initiated and canceled at any time. For more information please contact our Service Department.<\/p>","button_text":"Our products","button_link":"shopify:\/\/collections\/all"}}},"order":["main","1650302218f3be8ed5","1650302002cca9dd0e","165030201229493a67","1650302020878177f5"]}